---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunBeginWithRiser
source: html/ce75dd59-5235-cb66-a62e-56e59175786c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunBeginWithRiser Property

"Begin with Riser": Begin with Riser

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunBeginWithRiser { get; }
```